docs/fgem_pyro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-24 Fri 16:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #C8FF03;">import</span> os

<span style="color: #C8FF03;">import</span> jax.numpy <span style="color: #C8FF03;">as</span> np
<span style="color: #C8FF03;">import</span> jax.random <span style="color: #C8FF03;">as</span> random
<span style="color: #C8FF03;">from</span> IPython.display <span style="color: #C8FF03;">import</span> set_matplotlib_formats
<span style="color: #C8FF03;">import</span> jax.numpy <span style="color: #C8FF03;">as</span> np
<span style="color: #C8FF03;">from</span> jax <span style="color: #C8FF03;">import</span> random, vmap
<span style="color: #C8FF03;">from</span> jax.scipy.special <span style="color: #C8FF03;">import</span> logsumexp
<span style="color: #C8FF03;">import</span> matplotlib.pyplot <span style="color: #C8FF03;">as</span> plt
<span style="color: #C8FF03;">import</span> numpy <span style="color: #C8FF03;">as</span> onp
<span style="color: #C8FF03;">import</span> pandas <span style="color: #C8FF03;">as</span> pd
<span style="color: #C8FF03;">import</span> seaborn <span style="color: #C8FF03;">as</span> sns
<span style="color: #C8FF03;">from</span> jax.scipy.special <span style="color: #C8FF03;">import</span> expit, logit
<span style="color: #C8FF03;">import</span> numpyro
<span style="color: #C8FF03;">from</span> numpyro.diagnostics <span style="color: #C8FF03;">import</span> hpdi
<span style="color: #C8FF03;">import</span> numpyro.distributions <span style="color: #C8FF03;">as</span> dist
<span style="color: #C8FF03;">from</span> numpyro <span style="color: #C8FF03;">import</span> handlers
<span style="color: #C8FF03;">from</span> numpyro.infer <span style="color: #C8FF03;">import</span> MCMC, NUTS

plt.style.use(<span style="color: #FFABAB;">'bmh'</span>)
<span style="color: #C8FF03;">if</span> <span style="color: #FFABAB;">"NUMPYRO_SPHINXBUILD"</span> <span style="color: #C8FF03;">in</span> os.environ:
    set_matplotlib_formats(<span style="color: #FFABAB;">'svg'</span>)

<span style="color: #C8FF03;">assert</span> numpyro.__version__.startswith(<span style="color: #FFABAB;">'0.2.4'</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-jupyter-python">

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">finnish_horseshoe</span>(M, m0, N, var, half_slab_df, slab_scale2, tau_tilde, c2_tilde, lambd, beta_tilde):

    <span style="color: #FF9326;">tau0</span> = (m0/(M-m0) * (np.sqrt(var)/np.sqrt(1.0*N)))
    <span style="color: #FF9326;">tau</span> = tau0 * tau_tilde
    <span style="color: #FF9326;">c2</span> = slab_scale2 * c2_tilde
    <span style="color: #FF9326;">lambd_tilde</span> = np.sqrt(c2 * lambd**2 / (c2 + tau**2 * lambd**2))
    <span style="color: #FF9326;">beta</span> = tau * lambd_tilde * beta_tilde

    <span style="color: #C8FF03;">return</span>(beta)


<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">fgem_fin_normal</span>(X,BF=<span style="color: #C04040;">None</span>,slab_df=1,slab_scale=1,expected_large_covar_num=10):
      r<span style="color: #6E8C02;">"simplest FGEM possible"</span>
      <span style="color: #5D6A70;">#    </span><span style="color: #5D6A70;">num_genes = BF.shape[0]</span>
      <span style="color: #FF9326;">num_features</span> = X.shape[1]
      <span style="color: #FF9326;">Beta0_prior</span> = dist.Normal(-1,5)


      <span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">update from pymc3</span>
      <span style="color: #FF9326;">half_slab_df</span> = slab_df/2
      <span style="color: #FF9326;">variance</span> = y_vals.var()
      <span style="color: #FF9326;">slab_scale2</span> = slab_scale**2
      <span style="color: #FF9326;">hs_shape</span> = (design_mat.shape[1],)

      <span style="color: #FF9326;">beta_tilde</span> = numpyro.sample(<span style="color: #FFABAB;">'beta_tilde'</span>, dist.Normal(0., 1.), sample_shape=hs_shape)
      <span style="color: #FF9326;">lambd</span> = numpyro.sample(<span style="color: #FFABAB;">'lambd'</span>, dist.HalfCauchy(1.), sample_shape=hs_shape)
      <span style="color: #FF9326;">tau_tilde</span> = numpyro.sample(<span style="color: #FFABAB;">'tau_tilde'</span>, dist.HalfCauchy(1.))
      <span style="color: #FF9326;">c2_tilde</span> = numpyro.sample(<span style="color: #FFABAB;">'c2_tilde'</span>, dist.InverseGamma(half_slab_df, half_slab_df))

      <span style="color: #FF9326;">bC</span> = finnish_horseshoe(M = hs_shape[0],
                             m0 = expected_large_covar_num,
                             N = N,
                             var = variance,
                             half_slab_df = half_slab_df, 
                             slab_scale2 = slab_scale2,
                             tau_tilde = tau_tilde,
                             c2_tilde = c2_tilde,
                             lambd = lambd, 
                             beta_tilde = beta_tilde)


      <span style="color: #FF9326;">Beta0</span>  = numpyro.sample(<span style="color: #FFABAB;">"Beta0"</span>,Beta0_prior)
      <span style="color: #FF9326;">Beta_prior</span> = dist.Normal(np.zeros(num_features),np.ones(num_features)*5)
      <span style="color: #FF9326;">Beta</span> = numpyro.sample(<span style="color: #FFABAB;">"Beta"</span>,Beta_prior)
      <span style="color: #FF9326;">pvec</span> = expit(np.<span style="color: #B46DCC;">sum</span>( Beta * X + Beta0,axis=-1))
      <span style="color: #FF9326;">lik</span> = np.<span style="color: #B46DCC;">sum</span>(np.log(pvec * BF + (1-pvec)))
      numpyro.factor(<span style="color: #FFABAB;">'lik'</span>,lik)





  <span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">fgem_normal</span>(X,BF=<span style="color: #C04040;">None</span>):
      r<span style="color: #6E8C02;">"simplest FGEM possible"</span>
      <span style="color: #5D6A70;">#    </span><span style="color: #5D6A70;">num_genes = BF.shape[0]</span>
      <span style="color: #FF9326;">num_features</span> = X.shape[1]
      <span style="color: #FF9326;">Beta0_prior</span> = dist.Normal(-1,5)
      <span style="color: #FF9326;">Beta0</span>  = numpyro.sample(<span style="color: #FFABAB;">"Beta0"</span>,Beta0_prior)
      <span style="color: #FF9326;">Beta_prior</span> = dist.Normal(np.zeros(num_features),np.ones(num_features)*5)
      <span style="color: #FF9326;">Beta</span> = numpyro.sample(<span style="color: #FFABAB;">"Beta"</span>,Beta_prior)
      <span style="color: #FF9326;">pvec</span> = expit(np.<span style="color: #B46DCC;">sum</span>( Beta * X + Beta0,axis=-1))
      <span style="color: #FF9326;">lik</span> = np.<span style="color: #B46DCC;">sum</span>(np.log(pvec * BF + (1-pvec)))
      numpyro.factor(<span style="color: #FFABAB;">'lik'</span>,lik)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python">
<span style="color: #C8FF03;">import</span> h5py
<span style="color: #C8FF03;">import</span> os
os.getcwd()
<span style="color: #C8FF03;">with</span> h5py.File(<span style="color: #FFABAB;">"../data/models_hdf/UCS.h5"</span>,<span style="color: #FFABAB;">'r'</span>) <span style="color: #C8FF03;">as</span> h5f:
    <span style="color: #FF9326;">X</span> = (h5f[<span style="color: #FFABAB;">'x'</span>][:,:]).transpose()
    <span style="color: #FF9326;">y</span>= h5f[<span style="color: #FFABAB;">'y'</span>][:]

<span style="color: #C8FF03;">print</span>(X.shape)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python">
<span style="color: #FF9326;">rng_key</span> = random.PRNGKey(0)
<span style="color: #FF9326;">rng_key</span>, <span style="color: #FF9326;">rng_key_</span> = random.split(rng_key)

<span style="color: #FF9326;">num_warmup</span>, <span style="color: #FF9326;">num_samples</span> = 1000, 2000

<span style="color: #FF9326;">kernel</span> = NUTS(fgem_normal)
<span style="color: #FF9326;">mcmc</span> = MCMC(kernel, num_warmup, num_samples, num_chains=1,
                progress_bar=<span style="color: #C04040;">True</span>)
mcmc.run(rng_key, X, y)
<span style="color: #FF9326;">ms</span>=mcmc.get_samples()
mcmc.print_summary()
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-07-24 Fri 16:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
